frontend/backend/app/controllers/api/notes_controller.rb

    def index
      render json: Note.order(created_at: :desc)
---
SELECT "notes".* FROM "notes" ORDER BY "notes"."created_at" DESC